// Прогон тестов на всех доступных платформах 1С
#Использовать asserts
#Использовать v8find
#Использовать 1testrunner
#Использовать ".."

УправлениеИБ = Новый УправлениеИБ;
Сообщить(УправлениеИБ.Версия());
_Платформа1С = Новый МенеджерПлатформы1С;

ТаблицаУстановленныхВерсий = _Платформа1С.ПолучитьТаблицуУстановленныхВерсий();
Для Каждого СтрокаТЗ Из ТаблицаУстановленныхВерсий Цикл
	Если СтрНайти(СтрокаТЗ.ДоступныеПриложения, "ibcmd") > 0 Тогда
		Тестер = Новый Тестер;
		ПутьКIBCMD = _Платформа1С.ПутьКIBCMD(СтрокаТЗ.НомерВерсии, СтрокаТЗ.Разрядность);
		УстановитьПеременнуюСреды("IBCMD_PATH", ПутьКIBCMD, РасположениеПеременнойСреды.Процесс);
		Сообщить("Тестирование с версией платформы " + СтрокаТЗ.НомерВерсии);
		_Команда = Новый Массив;
		_Команда.Добавить("ibcmdrunner-test.os");
		Тестер.ВыполнитьКоманду(_Команда);
	КонецЕсли;	
КонецЦикла;	
