
#Использовать ".."
#Использовать asserts

#Область СлужебныйПрограммныйИнтерфейс

&Тест
Процедура ТестДолжен_ПолучитьВерсию() Экспорт

	// Дано
	УправлениеАС = Новый УправлениеАС;

	// Когда
	НомерВерсии = УправлениеАС.Версия();

	// Тогда
	РегулярноеВыражение = Новый РегулярноеВыражение("^(\d+)\.(\d+)\.(\d+)\.(\d+)\z");
	Утверждения.ПроверитьИстину(РегулярноеВыражение.Совпадает(НомерВерсии), 
		"Номер версии должен соответствовать шаблону:" + НомерВерсии);
		
КонецПроцедуры

&Тест
Процедура ТестДолжен_УстановитьНекорректнуюВерсию() Экспорт

	// Дано
	УправлениеАС = Новый УправлениеАС;
	
	// Когда
	ПараметрыМетода = Новый Массив;
	ПараметрыМетода.Добавить("8.3.23.1111");
	
	// Тогда
	Ожидаем.Что(УправлениеАС)
		.Метод("УстановитьВерсию", ПараметрыМетода)
		.ВыбрасываетИсключение("Не найдена установленная версия платформы");
		
КонецПроцедуры

#КонецОбласти
