#Использовать ".."

Сообщить("Начало " + ТекущаяДата());
УправлениеИБ = Новый УправлениеИБ;

УправлениеИБ.ПутьКПриложению("""c:\Program Files\1cv8\8.3.18.1483\bin\ibcmd""");

КаталогАрхива = ОбъединитьПути(ТекущийСценарий().Каталог, "fixtures", "1.0");
КаталогИБ = ОбъединитьПути(ТекущийСценарий().Каталог, "fixtures", "1.0", "update_after_dynamic");
ИмяАрхива = ОбъединитьПути(ТекущийСценарий().Каталог, "fixtures", "1.0", "update_after_dynamic.zip");

УдалитьФайлы(КаталогИБ, "*.*");

Архив = Новый ЧтениеZipФайла(ИмяАрхива);
Архив.ИзвлечьВсе(КаталогАрхива, РежимВосстановленияПутейФайловZIP.Восстанавливать);

УправлениеИБ.УстановитьПараметрыФайловойИБ(КаталогИБ);
УправлениеИБ.УстановитьПараметрыАвторизацииИБ("Администратор");
УправлениеИБ.УстановитьПараметрыАвтономногоСервера(КаталогИБ);
УправлениеИБ.ОбновитьКонфигурациюБазыДанных();
Сообщить("ОК " + ТекущаяДата());